Рассматривается множество целых чисел, принадлежащих числовому отрезку [300000; 600000], в которых правая цифра равна 6 или 3, вторая справа цифра не 1, и которые делятся на 23.

Найдите количество таких чисел и максимальное из них.

В ответе запишите два целых числа: сначала количество, затем максимальное число.

```python
k = 0
for i in range(300000, 600000):
  i = str(i)
  if (i[-1] == '6' or i[-1] == '3') and i[-2] != '1' and int(i) % 23 == 0:
    k += 1
    print(k, i)
```
