Рассматривается множество целых чисел, принадлежащих числовому отрезку [300000; 600000], в которых правая цифра равна 6 или 3, вторая справа цифра не 1, и которые делятся на 23.

Найдите количество таких чисел и максимальное из них.

В ответе запишите два целых числа: сначала количество, затем максимальное число.

```python
k = 0
for i in range(300000, 600000):
  i = str(i)
  if (i[-1] == '6' or i[-1] == '3') and i[-2] != '1' and int(i) % 23 == 0:
    k += 1
    print(k, i)
```

Рассматривается множество целых чисел, принадлежащих числовому отрезку [100000; 300000], в которых третья справа цифра 2 и которые делятся хотя бы на одно из чисел 24, 35, 30 и 27.

Найдите количество таких чисел и максимальное из них.

В ответе запишите два целых числа: сначала количество, затем максимальное число.

```python
k = 0
for i in range(100000, 300000):
  i = str(i)
  if i[-3] == '2':
    i = int(i)
    if i % 24 == 0 or i % 35 == 0 or i % 30 == 0 or i % 27 == 0:
      k += 1
      print(k, i)
```

Рассматривается множество целых чисел, принадлежащих числовому отрезку [100000; 300000], в которых третья справа цифра 3 и которые делятся ровно на одно из чисел 47, 31 и 25.

Найдите количество таких чисел и максимальное из них.

В ответе запишите два целых числа: сначала количество, затем максимальное число.

```python
k = 0
for i in range(100000, 300000):
  i = str(i)
  if i[-3] == '3':
    i = int(i)
    if [str(i % 47), str(i % 31), str(i % 25)].count('0') == 1:
      k += 1
      print(k, i)
```
