Рассматривается множество целых чисел, принадлежащих числовому отрезку [300000; 600000], в которых правая цифра равна 6 или 3, вторая справа цифра не 1, и которые делятся на 23.

Найдите количество таких чисел и максимальное из них.

В ответе запишите два целых числа: сначала количество, затем максимальное число.

```python
k = 0
for i in range(300000, 600000):
  i = str(i)
  if (i[-1] == '6' or i[-1] == '3') and i[-2] != '1' and int(i) % 23 == 0:
    k += 1
    print(k, i)
```

Рассматривается множество целых чисел, принадлежащих числовому отрезку [100000; 300000], в которых третья справа цифра 2 и которые делятся хотя бы на одно из чисел 24, 35, 30 и 27.

Найдите количество таких чисел и максимальное из них.

В ответе запишите два целых числа: сначала количество, затем максимальное число.

```python
k = 0
for i in range(100000, 300000):
  i = str(i)
  if i[-3] == '2':
    i = int(i)
    if i % 24 == 0 or i % 35 == 0 or i % 30 == 0 or i % 27 == 0:
      k += 1
      print(k, i)
```

Рассматривается множество целых чисел, принадлежащих числовому отрезку [100000; 300000], в которых третья справа цифра 3 и которые делятся ровно на одно из чисел 47, 31 и 25.

Найдите количество таких чисел и максимальное из них.

В ответе запишите два целых числа: сначала количество, затем максимальное число.

```python
k = 0
for i in range(100000, 300000):
  i = str(i)
  if i[-3] == '3':
    i = int(i)
    if [str(i % 47), str(i % 31), str(i % 25)].count('0') == 1:
      k += 1
      print(k, i)
```

Назовём натуральное число подходящим, если ровно два из его делителей входят в список (15, 13, 48, 12, 24).

Определите количество подходящих чисел, принадлежащих отрезку [15 000; 45 000], а также наименьшее из таких чисел.

В ответе запишите два целых числа: сначала количество, затем наименьшее число.

```python
sum = 0
k = 0
for i in range(15000, 45000):
  if [str(i % 12), str(i % 13), str(i % 15), str(i % 24) , str(i % 48)].count('0') == 2:
    k += 1
    print(k, i)
```

Определите количество принадлежащих отрезку [187046; 267245] натуральных чисел, которые делятся без остатка на сумму своих цифр, и наибольшее из таких чисел.
В ответе запишите два целых числа: сначала количество, затем наибольшее число.

```python
k = 0
for i in range(187_046, 267_245):
  i = str(i)
  summer = int(i[0]) + int(i[1]) + int(i[2]) + int(i[3]) + int(i[4]) + int(i[5])
  if int(i) % summer == 0:
    k += 1
    print(k, i)
```

содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от 0 до 10 000 включительно.

Определите и запишите в ответе сначала количество пар элементов последовательности, в которых хотя бы одно число в 14-ричной системе счисления оканчивается на 78, затем максимальную из сумм элементов таких пар.

```python
def fun(x):
  res = ''
  while x:
    res += str(x % 14)
    x //= 14
  return res


f = open('EGE_17_01.txt')
a = [i.strip() for i in f]
maxsum = []
k = 0
for i in range(len(a)):
  sum1 = a[i]
  sum2 = a[i-1]
  x1 = fun(int(a[i]))
  x2 = fun(int(a[i-1]))
  if (x1[0] == '8' and x1[1] == '7') or (x2[0] == '8' and x2[1] == '7'):
    k += 1
    maxsum.append(int(sum1)+int(sum2))
    print(sum1, sum2)
print(k, max(maxsum))
```

В файле EGE_17_02 содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10000 до 10000 включительно.

Определите и запишите в ответе сначала количество пар элементов последовательности, в которых, затем минимальное из произведений модулей элементов таких пар.

В данной задаче под парой подразумевается два идущих подряд элемента последовательности.

```python
f = open('EGE_17_02.txt')
a = [i.strip() for i in f]
k = 0
for i in range(len(a)):
  x1 = str(a[i])
  x2 = str(a[i-1])
  if x1[-1] == x2[-1]:
    x1 = int(x1)
    x2 = int(x2)
    if (x1 % 10) % 2 == 0:
      if x1 % 25 != 0 and x2 % 25 != 0:
        k += 1
        print(k, x1,x2, abs(int(x1)*int(x2)))
```

содержится последовательность целых чисел. Элементы последовательности могут принимать целые значения от -10000 до 10000 включительно.

Определите и запишите в ответе сначала количество пар элементов последовательности, в которых модуль суммы элементов пары имеет значение, не превосходящее 4100 и при этом не менее 1400, затем максимальное из чисел, которые являются элементами таких пар.

В данной задаче под парой подразумевается два идущих подряд элемента последовательности.

```python
f = open('EGE_17_02.txt')
a = [i.strip() for i in f]
k = 0
maxabs = []
for i in range(0, len(a)):
  x1 = int(a[i])
  x2 = int(a[i-1])
  absx1x2 = abs(x1+x2)
  if 1400 <= absx1x2 <= 4100:
    k += 1
    maxabs.append(x1)
    maxabs.append(x2)
    print(k, x1, x2, max(maxabs))
```
