У исполнителя Калькулятор три команды, которым присвоены номера:
1. прибавь 1
2. умножь на 3
3. умножь на 4
Программа для Калькулятора – это последовательность команд.
Сколько есть программ, которые число 1 преобразуют в число 18?

```python
def make(x,y):
    if x == y:
        return 1
    if x > y:
        return 0
    if x < y:
        return make(x+1, y) + make(x*3, y) + make(x*4, y)

n = make(1,18)
print(n)
```
У исполнителя Калькулятор три команды, которым присвоены номера:
1. прибавь 1
2. прибавь 2
3. прибавь 3
Программа для Калькулятора – это последовательность команд.
Сколько существует программ, для которых при исходном числе 2 результатом является число 14 и при этом траектория вычислений содержит число 8?

```python
def make(x,y):
    if x == y:
        return 1
    if x > y:
        return 0
    if x < y:
        return make(x+1,y) + make(x+2, y) + make(x+3, y)
n = make(2, 8) * make(8, 14)
print(n)
```

У исполнителя Калькулятор две команды, которым присвоены номера:
1. прибавь 1
2. прибавь 2
Программа для Калькулятора – это последовательность команд.
Сколько существует программ, для которых при исходном числе 2 результатом является число 19 и при этом траектория вычислений содержит число 13 и не содержит число 12?

```python
def make(x,y):
    if x == y:
        return 1
    if x > y or x == 12:
        return 0
    if x < y:
        return make(x+1, y) + make(x+2, y)
n = make(2, 13) * make(13, 19)
print(n)
```

У исполнителя Калькулятор две команды, которым присвоены номера:
1. прибавь 1
2. умножь на 3
Программа для Калькулятора – это последовательность команд.
Сколько существует программ, для которых при исходном числе 2 результатом является число 58 и при этом траектория вычислений содержит число 16 и не содержит число 41?

```python
def make(x,y):
    if x == y:
        return 1
    if x > y or x == 41:
        return 0
    if x < y:
        return make(x+1,y) + make(x*3, y)
n = make(2, 16) * make(16, 58)
print(n)
```
