Определите максимальное количество идущих подряд символов, расположенных в алфавитном порядке (возможно с повторением символов).

```python
f = open('EGE_24_01_13.txt').readline()
a = []
k = 1
for i in range(len(f)-1):
  if f[i] <= f[i+1]:
    k += 1
  else:
    a.append(k)
    k = 1
print(max(a))
```
