Напишите программу, которая ищет в порядке возрастания среди целых чисел, принадлежащих числовому отрезку [247822; 247867], числа, имеющие ровно 4 различных делителя, отличных от 1 и самого числа.
Выведите эти четыре делителя для каждого найденного числа в порядке возрастания.

```python
def div(x):
  d = 2
  a = []
  while d ** 2 <= x:
    if x % d == 0:
      a.append(d)
      a.append(x//d)
    d += 1
  a.sort()
  return a

for i in range(247822,247867):
  if len(div(i)) == 4:
    print(div(i))
```

Пусть F - разность максимального и минимального натуральных делителей целого числа, не считая единицы и самого числа. Если таких делителей у числа нет, то считаем значение F равным нулю.

Напишите программу, которая перебирает целые числа, большие 150000, в порядке возрастания и ищет среди них такие, для которых значение F не равно нулю и делится нацело на 5.
Программа должна найти и вывести первые 5 таких чисел и соответствующие им значения F.

Сначала выводится само число, а затем значение F

```python
def f(x):
  d = 2
  a = []
  while d ** 2 <= x:
    if x % d == 0:
      a.append(d)
      a.append(x//d)
    d += 1
  a.sort()
  if a == []:
    return 0
  return max(a) - min(a)

for i in range(150000, 150050):
  if f(i) != 0 and f(i) % 5 == 0:
    print(i, f(i))
```

Напишите программу, которая перебирает целые числа, большие 650000, в порядке возрастания и ищет среди них такие, для которых наибольший натуральный делитель, не равный самому числу и единице, не является простым числом.
Программа должна найти и вывести первые 5 таких чисел и соответствующие им значения упомянутых делителей.

```python
def isSimple(x):
    d = 2
    while d * d <= x:
        if x % d == 0:
            return False
        d += 1
    return True

def div(x):
  d = 2
  a = []
  while d ** 2 <= x:
    if x % d == 0:
      a.append(d)
      a.append(x//d)
    d += 1
  a.sort()
  result = max(a)
  return result

for i in range(650001, 650007):
  if isSimple(div(i)) == False:
    print(i, div(i))
```

Пусть S - сумма различных натуральных делителей целого числа, являющихся простыми числами.

Напишите программу, которая перебирает целые числа, большие 750000, в порядке возрастания и ищет среди них такие, для которых значение S оканчивается на цифру 4.

Программа должна найти и вывести первые 5 таких чисел и соответствующие им значения S.

```python
def isSimple(x):
    d = 2
    while d * d <= x:
        if x % d == 0:
            return False
        d += 1
    return True

def div(x):
  d = 2
  a = []
  while d ** 2 <= x:
    if x % d == 0 and isSimple(d) == True:
      a.append(d)
    if x % d == 0 and isSimple(x//d) == True:
      a.append(x//d)
    d += 1
  a.sort()
  result = sum(a)
  return result

for i in range(750000, 750070):
  if str(div(i))[-1] == '4':
    print(i, div(i))
```
