Напишите программу, которая ищет в порядке возрастания среди целых чисел, принадлежащих числовому отрезку [247822; 247867], числа, имеющие ровно 4 различных делителя, отличных от 1 и самого числа.
Выведите эти четыре делителя для каждого найденного числа в порядке возрастания.

```python
def div(x):
  d = 2
  a = []
  while d ** 2 <= x:
    if x % d == 0:
      a.append(d)
      a.append(x//d)
    d += 1
  a.sort()
  return a

for i in range(247822,247867):
  if len(div(i)) == 4:
    print(div(i))
```
