Напишите программу, которая ищет в порядке возрастания среди целых чисел, принадлежащих числовому отрезку [247822; 247867], числа, имеющие ровно 4 различных делителя, отличных от 1 и самого числа.
Выведите эти четыре делителя для каждого найденного числа в порядке возрастания.

```python
def div(x):
  d = 2
  a = []
  while d ** 2 <= x:
    if x % d == 0:
      a.append(d)
      a.append(x//d)
    d += 1
  a.sort()
  return a

for i in range(247822,247867):
  if len(div(i)) == 4:
    print(div(i))
```

Пусть S - сумма различных натуральных делителей целого числа, являющихся простыми числами.

Напишите программу, которая перебирает целые числа, большие 750000, в порядке возрастания и ищет среди них такие, для которых значение S оканчивается на цифру 4.

Программа должна найти и вывести первые 5 таких чисел и соответствующие им значения S.

```python
def isSimple(x):
    d = 2
    while d * d <= x:
        if x % d == 0:
            return False
        d += 1
    return True

def div(x):
  d = 2
  a = []
  while d ** 2 <= x:
    if x % d == 0 and isSimple(d) == True:
      a.append(d)
    if x % d == 0 and isSimple(x//d) == True:
      a.append(x//d)
    d += 1
  a.sort()
  result = sum(a)
  return result

for i in range(750000, 750070):
  if str(div(i))[-1] == '4':
    print(i, div(i))
```
