Автомат получает на вход трёхзначное число. По этому числу строится новое число по следующим правилам.
1. Складываются первая и вторая, а также вторая и третья цифры исходного числа.
2. Полученные два числа записываются друг за другом в порядке убывания (без разделителей).
Пример. Исходное число: 348. Суммы: 3 + 4 = 7; 4 + 8 = 12. Результат: 127.
Укажите наибольшее число, в результате обработки которого автомат выдаст число 1410.

```python
for x in range(100,999):
    res = x
    x = str(x)
    x0 = x[0]
    x1 = x[1]
    x2 = x[2]
    sum01 = str(int(x0) + int(x1))
    sum12 = str(int(x1) + int(x2))
    if (sum01 == '14' and sum12 == '10') or (sum01 == '10' and sum12 == '14'):
        print(res)
```

Автомат получает на вход два трехзначных числа. По этим числам строится новое число по следующим правилам. Вычисляются три числа – сумма старших разрядов заданных трехзначных чисел, сумма средних разрядов этих чисел, сумма младших разрядов. Полученные три числа записываются друг за другом в порядке неубывания (без разделителей).
   Пример. Исходные трехзначные числа:  835, 196. Поразрядные суммы: 9, 12, 11. Результат: 91112
   Какое наибольшее значение может иметь одно из чисел, полученных на входе, если другое число равно 650, а в результате работы автомата получено число 999?
   
```python
x = '650'
for y in range(100,999):
    x2 = str(y)
    sum0 = int(x[0]) + int(x2[0])
    sum1 = int(x[1]) + int(x2[1])
    sum2 = int(x[2]) + int(x2[2])
    print(x2, sum0, sum1, sum2)
```

У исполнителя Калькулятор две команды, которым присвоены номера:
   1. прибавь 1
   2. прибавь 3
Программа для Калькулятора – это последовательность команд.
Сколько существует программ, для которых при исходном числе 3 результатом является число 20 и при этом траектория вычислений содержит ровно одно из чисел 13 и 12?

```python
def make(x,y):
    if x == y:
        return 1
    if x > y or x == 12:
        return 0
    if x < y:
        return make(x+1, y) + make(x+3,y)
n = make(3, 13) * make(13, 20)

print(76+81)
```
