Автомат получает на вход трёхзначное число. По этому числу строится новое число по следующим правилам.
1. Складываются первая и вторая, а также вторая и третья цифры исходного числа.
2. Полученные два числа записываются друг за другом в порядке убывания (без разделителей).
Пример. Исходное число: 348. Суммы: 3 + 4 = 7; 4 + 8 = 12. Результат: 127.
Укажите наибольшее число, в результате обработки которого автомат выдаст число 1410.

```python
for x in range(100,999):
    res = x
    x = str(x)
    x0 = x[0]
    x1 = x[1]
    x2 = x[2]
    sum01 = str(int(x0) + int(x1))
    sum12 = str(int(x1) + int(x2))
    if (sum01 == '14' and sum12 == '10') or (sum01 == '10' and sum12 == '14'):
        print(res)
```
