# ЕГЭ №8. Комбинаторика
Михаил составляет 3-буквенные коды. В кодах разрешается использовать только буквы О, А, Б и И, при этом код не может начинаться с гласной и не может содержать двух одинаковых букв подряд. Сколько различных кодов может составить Михаил?
```python
a = 'ОАБИ'
k = 0
for a1 in a:
    for a2 in a:
        for a3 in a:
            x = a1 + a2 + a3
            if a1 not in ['А', 'О', 'И'] and a1 != a2 and a2 != a3:
                k += 1
print(k)
```
