# ЕГЭ №8. Комбинаторика
Михаил составляет 3-буквенные коды. В кодах разрешается использовать только буквы О, А, Б и И, при этом код не может начинаться с гласной и не может содержать двух одинаковых букв подряд. Сколько различных кодов может составить Михаил?
```python
a = 'ОАБИ'
k = 0
for a1 in a:
    for a2 in a:
        for a3 in a:
            x = a1 + a2 + a3
            if a1 not in ['А', 'О', 'И'] and a1 != a2 and a2 != a3:
                k += 1
print(k)
```
Герасим составляет 3-буквенные коды из букв Б, В и А. Каждую букву нужно использовать ровно 1 раз, при этом нельзя ставить подряд две гласные или две согласные. Сколько различных кодов может составить Герасим?
```python
a = 'БВА'
k = 0
for a1 in a:
    for a2 in a:
        for a3 in a:
            x = a1 + a2 + a3
            if x.count('А') == 1 and x.count('Б') == 1 and x.count('В') == 1:
                if 'АА' not in x and 'БВ' not in x and 'ВБ' not in x:
                    k += 1
print(k)
```
Сколько существует различных символьных последовательностей длины 5 в алфавите {О, Н, З, С, А и Т}, которые содержат ровно две буквы А?
```python
a = 'ОНЗСАТ'
k = 0
for a1 in a:
    for a2 in a:
        for a3 in a:
            for a4 in a:
                for a5 in a:
                    x = a1 + a2 + a3 + a4 + a5
                    if x.count('А') == 2:
                        k += 1
print(k)
```
Сколько существует четырехзначных чисел, кратных 5, в записи которых используются цифры от 0 до 8, при этом каждая цифра используется не более одного раза?
```python
k = 0
for x in range(1000, 10000):
    x = str(x)
    if x.count('0') <= 1 and x.count('1') <= 1 and x.count('2') <= 1 and x.count('3') <= 1 and x.count('4') <= 1 and x.count('5') <= 1 and x.count('6') <= 1 and x.count('7') <= 1 and x.count('8') <= 1 and x.count('9') == 0:
        if int(x) % 5 == 0:
            k += 1
print(k)
```
Сколько существует трехзначных чисел, кратных 5, в записи которых используются цифры от 0 до 5, при этом никакие две четные и две нечетные цифры не стоят рядом?
```python
k = 0
for x in range(100, 1000):
    x = str(x)
    if x.count('6') == 0 and x.count('7') == 0 and x.count('8') == 0 and x.count('9') == 0:
        if ('00' not in x) and ('02' not in x) and ('04' not in x):
            if ('20' not in x) and ('22' not in x) and ('24' not in x):
                if ('40' not in x) and ('42' not in x) and ('44' not in x):
                    if ('11' not in x) and ('13' not in x) and ('15' not in x):
                        if ('31' not in x) and ('33' not in x) and ('35' not in x):
                            if ('51' not in x) and ('53' not in x) and ('55' not in x):
                                if int(x) % 5 == 0:
                                    k += 1
print(k)
```
Сколько существует четных пятизначных чисел, в записи которых используются цифры от 0 до 7, при этом никакие две четные и две нечетные цифры не стоят рядом и каждая цифра используется не более одного раза?
```python
k = 0
for x in range(10000, 100000):
    x = str(x)
    if (x.count('0') <= 1) and (x.count('1') <= 1) and (x.count('2') <= 1) and (x.count('3') <= 1) and x.count('4') <= 1 and x.count('5') <= 1 and x.count('6') <= 1 and x.count('7') <= 1 and x.count('8') == 0 and x.count('9') == 0:
        if ('00' not in x) and ('02' not in x) and ('04' not in x) and ('06' not in x):
            if ('20' not in x) and ('22' not in x) and ('24' not in x) and ('26' not in x):
                if ('40' not in x) and ('42' not in x) and ('44' not in x) and ('46' not in x):
                    if ('60' not in x) and ('62' not in x) and ('64' not in x) and ('66' not in x):
                        if ('11' not in x) and ('13' not in x) and ('15' not in x) and ('17' not in x):
                            if ('31' not in x) and ('33' not in x) and ('35' not in x) and ('37' not in x):
                                if ('51' not in x) and ('53' not in x) and ('55' not in x) and ('57' not in x):
                                    if ('71' not in x) and ('73' not in x) and ('75' not in x) and ('77' not in x):
                                        if int(x) % 2 == 0:
                                            k += 1
print(k)
```
Составляются 5-буквенные коды из букв А, Б, В, Г, Д. Каждую букву нужно использовать ровно 1 раз, при этом код не может начинаться с буквы Д и не может содержать сочетания БВ. Сколько различных кодов можно составить?
```python
a = 'АБВГД'
k = 0
for a1 in a:
    for a2 in a:
        for a3 in a:
            for a4 in a:
                for a5 in a:
                    x = a1 + a2 + a3 + a4 + a5
                    if x.count('А') == 1 and x.count('Б') == 1 and x.count('В') == 1 and x.count('Г') == 1 and x.count('Д') == 1:
                        if a1 != 'Д':
                            if 'БВ' not in x:
                                k += 1
print(k)
```
