# ЕГЭ №8. Комбинаторика
Михаил составляет 3-буквенные коды. В кодах разрешается использовать только буквы О, А, Б и И, при этом код не может начинаться с гласной и не может содержать двух одинаковых букв подряд. Сколько различных кодов может составить Михаил?
```python
a = 'ОАБИ'
k = 0
for a1 in a:
    for a2 in a:
        for a3 in a:
            x = a1 + a2 + a3
            if a1 not in ['А', 'О', 'И'] and a1 != a2 and a2 != a3:
                k += 1
print(k)
```
Герасим составляет 3-буквенные коды из букв Б, В и А. Каждую букву нужно использовать ровно 1 раз, при этом нельзя ставить подряд две гласные или две согласные. Сколько различных кодов может составить Герасим?
```python
a = 'БВА'
k = 0
for a1 in a:
    for a2 in a:
        for a3 in a:
            x = a1 + a2 + a3
            if x.count('А') == 1 and x.count('Б') == 1 and x.count('В') == 1:
                if 'АА' not in x and 'БВ' not in x and 'ВБ' not in x:
                    k += 1
print(k)
```
Сколько существует различных символьных последовательностей длины 5 в алфавите {О, Н, З, С, А и Т}, которые содержат ровно две буквы А?
```python
a = 'ОНЗСАТ'
k = 0
for a1 in a:
    for a2 in a:
        for a3 in a:
            for a4 in a:
                for a5 in a:
                    x = a1 + a2 + a3 + a4 + a5
                    if x.count('А') == 2:
                        k += 1
print(k)
```
Сколько существует четырехзначных чисел, кратных 5, в записи которых используются цифры от 0 до 8, при этом каждая цифра используется не более одного раза?
```python
k = 0
for x in range(1000, 10000):
    x = str(x)
    if x.count('0') <= 1 and x.count('1') <= 1 and x.count('2') <= 1 and x.count('3') <= 1 and x.count('4') <= 1 and x.count('5') <= 1 and x.count('6') <= 1 and x.count('7') <= 1 and x.count('8') <= 1 and x.count('9') == 0:
        if int(x) % 5 == 0:
            k += 1
print(k)
```
